app/Views/backend/admin/dashboard/index.php

                                                    </div>
                                                    <div class="d-flex align-items-end justify-content-between mt-2">
                                                        <div>
                                                            <h4 class="fs-22 fw-semibold ff-secondary text-white mb-2"><span class="counter-value" data-target="<?=$db->table('users')->where(["role"=>2,])->countAllResults()?>"></span></h4>
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 2

                                                    </div>
                                                    <div class="d-flex align-items-end justify-content-between mt-2">
                                                        <div>
                                                            <h4 class="fs-22 fw-semibold ff-secondary text-white mb-2"><span class="counter-value" data-target="<?=$db->table('service')->countAllResults()?>"></span></h4>
---
SELECT COUNT(*) AS `numrows`
FROM `service`