app/Helpers/My_helper.php

SELECT `users`.*, `countries`.`name` as `country_name`, `states`.`name` as `state_name`
FROM `users`
LEFT JOIN `countries` ON `countries`.`id` = `users`.`country`
LEFT JOIN `states` ON `states`.`id` = `users`.`state`
WHERE `users`.`id` = '1'
---
  function get_user()
  {
    $session = session()->get('user');
    if(!empty($session))
    {
      $user_id = $session['id'];
      $db = db_connect();
      return $user = $db->table('users')->where('users.id', $user_id)
      ->join('countries', 'countries.id = ' . 'users.country', 'left')
      ->join('states', 'states.id = ' . 'users.state', 'left')
      ->select("users.*, countries.name as country_name, states.name as state_name ")
      ->get()->getRow();

SELECT *
FROM `role`
WHERE `id` = '1'
ORDER BY `name` ASC
---
  function get_role_by_id($role_id)
  {
    $db = db_connect();
    $data = $db->table("role")->orderBy("name","asc")->where(["id"=>$role_id,])->get()->getRow();