app/Controllers/AuthBackend.php

UPDATE `login_history` SET `status` = 0
WHERE `user_id` = '1'
AND `status` = 1
INSERT INTO `login_history` (`user_id`, `role`, `ip_address`, `date`, `time`, `status`, `device_id`, `password`, `firebase_token`, `access_token`) VALUES ('1', '1', '::1', '2025-10-14', '22:04:34', 1, '', 'e10adc3949ba59abbe56e057f20f883e', NULL, '')
SELECT *
FROM `role`
WHERE `id` = '1'
---
        ];

        // Update the login status of any previous sessions for the user
        $this->db->table('login_history')
            ->where(['user_id' => $user->id, 'status' => 1])
            ->update(['status' => 0]);

        // Insert new login history record
        if ($this->db->table('login_history')->insert($login_detail)) {
            // Get role data
            $role = $this->db->table('role')
                ->where('id', $user->role)
                ->get()
                ->getRow();

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
AND `role` IN (1,6)
---
    public function login_action()
    {
        // Get username and password from POST request
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Query the user from the database
        $user = $this->db->table('users')
            ->where(['email' => $username])
            ->whereIn('role', [1,6])
            ->get()
            ->getRow();

SELECT *
FROM `role`
WHERE `id` = '1'
---
        } else {
            // Get role data
            $role = $user->role;
            $roledata = $this->db->table('role')
                ->where('id', $role)
                ->get()
                ->getRow();

SELECT *
FROM `login_history`
WHERE `user_id` = '1'
AND `status` = 1
ORDER BY `id` DESC
---
            $this->token_session($user);

            // Check login history
            $login_detail = $this->db->table('login_history')
                ->orderBy('id', 'desc')
                ->where(['user_id' => $user->id, 'status' => 1])
                ->get()
                ->getRow();

UPDATE `login_history` SET `status` = 0
WHERE `user_id` = '1'
AND `status` = 1
---
    public function logout()
    {
        $db = db_connect();
        $session = session()->get('user');
        $user_id = $session['id'];
        $role = $session['role'];
        $db->table('login_history')->where(['user_id'=>$user_id,'status'=>1,])->update(['status'=>0,]);