app/Controllers/Home.php

    public function search_user($value='')
    {
        $search = $this->request->getVar('search');

        $table_name = 'users';
        $builder = $this->db->table($table_name)
            ->join('city', 'city.id = '.$table_name.'.city', 'left')
            ->join('states', 'states.id = '.$table_name.'.state', 'left')

            ->select("{$table_name}.*, city.name as city_name, states.name as state_name,
                CASE
                    WHEN {$table_name}.role = 3 THEN 'Advocate'
                    WHEN {$table_name}.role = 4 THEN 'CA'
                    WHEN {$table_name}.role = 5 THEN 'Adviser'
                    ELSE 'other'
                END AS role_name,
                ")
            ->where("{$table_name}.status", 1)
            ->whereIn("{$table_name}.role", [2])
            ->where("{$table_name}.is_delete", 0);
        if (!empty($search)) {
            $builder->groupStart()
                ->like("{$table_name}.name", $search)
                ->groupEnd();
        }
        $data_list = $builder
            ->orderBy("{$table_name}.id", 'desc')
            ->limit(50, 0)
            ->get()
            ->getResult();
---
SELECT `users`.*, `city`.`name` as `city_name`, `states`.`name` as `state_name`, CASE 
                    WHEN users.role = 3 THEN 'Advocate' 
                    WHEN users.role = 4 THEN 'CA' 
                    WHEN users.role = 5 THEN 'Adviser' 
                    ELSE 'other' 
                END AS role_name
FROM `users`
LEFT JOIN `city` ON `city`.`id` = `users`.`city`
LEFT JOIN `states` ON `states`.`id` = `users`.`state`
WHERE `users`.`status` = 1
AND `users`.`role` IN (2)
AND `users`.`is_delete` = 0
ORDER BY `users`.`id` DESC
 LIMIT 50