app/Models/ImageEditorModel.php

    public static function createCertificate($row)
    {
        $db = \Config\Database::connect();
        $user = $db->table("users")->where(["id" => $row->user_id])->get()->getFirstRow();
---
SELECT *
FROM `users`
WHERE `id` = '39'