app/Models/Setting.php

    public static function get()
    {
        $db = Database::connect();
        $setting = $db->table('setting')->whereIn('name',['main','logo'])->get()->getResultObject();
---
SELECT *
FROM `setting`
WHERE `name` IN ('main','logo')